notify-perf-test.yml
config:
  target: "https://yndezogjx7.execute-api.ap-southeast-2.amazonaws.com/Prod"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 1800
      arrivalRate: 10
      name: Sustained load

scenarios:
  - name: "Order Notify"
    flow:
      - post:
          url: "/notify"
          json:
            order_id: "static-order-id"