notify-perf-test.yml
config:
  target: "https://lb360um8xe.execute-api.ap-southeast-2.amazonaws.com/Prod"
  phases:
    - duration: 60
      arrivalRate: 2
      name: Warm up
    - duration: 120
      arrivalRate: 2
      rampTo: 5
      name: Ramp up load
    - duration: 1800
      arrivalRate: 4
      rampTo: 15
      name: Sustained load

scenarios:
  - name: "Order Notify"
    flow:
      - post:
          url: "/notify"
          json:
            order_id: "static-order-id"